Martinsbl/nrf5-mpu-examples/nrf5-mpu-fft/main.c
 /* 
  * This example is not extensively tested and only 
  * meant as a simple explanation and for inspiration. 
  * NO WARRANTY of ANY KIND is provided. 
  */

#include <stdio.h>
#include "boards.h"
#include "app_util_platform.h"
#include "app_uart.h"
#include "app_error.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "mpu.h"
#include "arm_math.h"


/* Pins to connect MPU. Pinout is different for nRF51 and nRF52 DK */
#define MPU_TWI_SCL_PIN 3
#define MPU_TWI_SDA_PIN 4

/*UART buffer size. */
#define UART_TX_BUF_SIZE 256
#define UART_RX_BUF_SIZE 1
static const nrf_drv_twi_t m_twi_instance = NRF_DRV_TWI_INSTANCE(0);

#define BUFFER_SIZE 2048
float input_buffer[BUFFER_SIZE];
float output_buffer[BUFFER_SIZE];
arm_status status;





/**
 * @brief UART events handler.
 */
static void uart_events_handler(app_uart_evt_t * p_event)
{
    switch (p_event->evt_type)
    {
        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}


/**
 * @brief UART initialization.
 * Just the usual way. Nothing special here
 */
static void uart_config(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_events_handler,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);

    APP_ERROR_CHECK(err_code);
}


/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{   
    // Pass TWI events down to the MPU driver.
    mpu_twi_event_handler(p_event);
}

/**
 * @brief TWI initialization.
 * Just the usual way. Nothing special here
 */
void twi_init(void)
{
    ret_code_t err_code;
    
    const nrf_drv_twi_config_t twi_mpu_config = {
       .scl                = MPU_TWI_SCL_PIN,
       .sda                = MPU_TWI_SDA_PIN,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH
    };
    
    err_code = nrf_drv_twi_init(&m_twi_instance, &twi_mpu_config, twi_handler, NULL);
    APP_ERROR_CHECK(err_code);
    
    nrf_drv_twi_enable(&m_twi_instance);
}

void mpu_setup(void)
{
    ret_code_t ret_code;
    // Initiate MPU driver with TWI instance handler
    ret_code = mpu_init(&m_twi_instance);
    APP_ERROR_CHECK(ret_code); // Check for errors in return value
    
    // Setup and configure the MPU with intial values
    mpu_config_t p_mpu_config = MPU_DEFAULT_CONFIG(); // Load default values
    p_mpu_config.smplrt_div = 19;   // Change sampelrate. Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV). 19 gives a sample rate of 50Hz
    p_mpu_config.accel_config.afs_sel = AFS_2G; // Set accelerometer full scale range to 2G
    ret_code = mpu_config(&p_mpu_config); // Configure the MPU with above values
    APP_ERROR_CHECK(ret_code); // Check for errors in return value 
}

void init_buffer(float * buffer)
{
    float *p_buffer;
    p_buffer = buffer;
    for(uint16_t i = 0; i < BUFFER_SIZE; i++)
    {
        *p_buffer = arm_sin_f32(2 * PI * i / 100) + arm_sin_f32(2 * PI * i / 150) ;
        p_buffer++;
    }
}

/**
 * @brief Function for main application entry.
 */
int main(void)
{    
//    uint32_t err_code;
    uart_config();
    printf("\033[2J\033[;HMPU simple example. Compiled @ %s\r\n", __TIME__);
    
    twi_init();
    mpu_setup();
    
    init_buffer(input_buffer);
    
//    for(uint16_t i = 0; i < BUFFER_SIZE; i++)
//    {
//        printf("%f\r\n", input_buffer[i]);
//        nrf_delay_ms(1);
//    }
    
    arm_rfft_instance_f32           fft_instance;
    arm_cfft_radix4_instance_f32    radix_instance;
    
    status = arm_rfft_init_f32(&fft_instance, &radix_instance, BUFFER_SIZE, 0, 1);
    arm_rfft_f32(&fft_instance, input_buffer, output_buffer);

    float magn_buffer[BUFFER_SIZE/2];
    arm_cmplx_mag_f32(output_buffer, magn_buffer, BUFFER_SIZE/2);

    float max_value;
    uint32_t max_index;
    arm_max_f32(magn_buffer, BUFFER_SIZE/2, &max_value, &max_index); 
    printf("\tMax value: %f\tIndex: %d\r\n", max_value, max_index);
    
    for(uint16_t i = 0; i < BUFFER_SIZE/2; i++)
    {
        printf("%f\r\n", magn_buffer[i]);
        nrf_delay_ms(1);
    }

//    for(uint16_t i = 0; i < 128; i++)
//    {
//        printf("%f\t %f\r\n", input_buffer[i], output_buffer[i]);
//        nrf_delay_ms(10);
//    }

    
    while(1);
//    accel_values_t acc_values;
//    uint32_t sample_number = 0;
//    while(1)
//    {
//        // Read accelerometer sensor values
//        err_code = mpu_read_accel(&acc_values);
//        APP_ERROR_CHECK(err_code);
//        // Clear terminal and print values
//        printf("\033[3;1HSample # %d\r\nX: %06d\r\nY: %06d\r\nZ: %06d", ++sample_number, acc_values.x, acc_values.y, acc_values.z);
//        nrf_delay_ms(250);
//    }
}

/** @} */
